// 8.Создай массив имён и отсортируй его по алфавиту.

// 9.Проверь, есть ли в массиве фильмов "итерстеллар" (используй includes).

// 10.Пройди по массиву циклом for или forEach и выведи каждый элемент.

// 11. Создай новый массив и замени каждый элемент массива с фильмами на объект с полями name(имя фильма), rating(рейтинг фильма от 1 до 5)

// 12. Создай новый массив с объектами фильмов, рейтинг которых больше 4

// 13.Создай объект person с полями: name, age, city.

// 14.Выведи имя человека из объекта.

// 15.Добавь новое поле hobby со значением "программирование".

// 16.Измени возраст на 30.

// 17.Удалите поле city.

// 18.Создай объект car с полями brand, model, year. Выведи модель.

// 19.Проверь, есть ли у объекта car поле year (используй in или hasOwnProperty).

// 20.Создай объект book, затем выведи все ключи (Object.keys) и значения (Object.values).

// 21.Создай массив объектов students, каждый из которых имеет name и grade. Выведи всех студентов с оценкой выше 90.

// Функции 
// 1. Создайте объект user с полями name, age и email, и напишите функцию, которая выводит информацию о пользователе в формате  
//    "Имя: name, Возраст: age, E-mail: email".

//    2. Напишите функцию, которая принимает на вход объект с товарами и их ценами, а затем выводит информацию о товарах, у которых   цена выше определённой суммы (250).

// 3. Создайте объект car с полями brand, model и year, и напишите функцию, которая принимает этот объект в качестве аргумента и возвращает строку вида "Год выпуска year, Модель brand model".
  
//   4. Напишите функцию, которая принимает массив объектов студентов (с полями name, age, grade) и возвращает средний возраст студентов.

// 5. Напишите функцию isEven , которая принимает в качестве аргумента число и возвращает true если число четное и false если нечётное 

// 6. Напишите функцию, которая принимает в качестве аргумента массив с числами и возвращает сумму всех чисел этого массива(нельзя использовать метод reduce)

// 7. Создайте стрелочную функцию, которая принимает 2 параметра как числа и возвращает результат умножения этих чисел








//Цыклы
// 1.Используя цикл выведи числа от 10 до 0
// for (let i = 10; i >= 0; i--){
//     console.log(i);
// }

// 2. Есть переменная n, которая хранит число, выведи все числа от 1 до n
// let n = 10;
// for (let i = 1; i <= n; i++) {
//     console.log(i);
// }

// 3. Выведи все четные числа от 1 до 100
// let evenNumbers = [];
// for (let i = 1; i <= 100; i++) {
//     if (i % 2 === 0) {
//         evenNumbers.push(i);
//     }
// }
// console.log(evenNumbers);



//Практика 
// 1
// let movies = ["Фильм 1", "Фильм 2", "Фильм 3", "Фильм 4", "Фильм 5"];
// console.log(movies);
// console.log(movies[1]);
// console.log(movies[movies.length - 1]);
// movies.push("Форрест Гамп")
// console.log(movies[movies.length - 1]);
// console.log(movies.shift());
// console.log(movies[2] = "Матрица");
// console.log(movies.length);
// console.log(movies);


// 2
// for (let i = 1; i <= 5; i++) {
//     console.log(i + 2);
// }



// 13.Создай объект person с полями: name, age, city.
// 14.Выведи имя человека из объекта.
// 15.Добавь новое поле hobby со значением "программирование".
// 16.Измени возраст на 30.
// 17.Удалите поле city.



// 3
// let names = ["Мухаммад", "Али", "Зухра", "Саид"];
// names.sort();
// console.log(names);


// 4
// let movies = ["Фильм 1", "Фильм 2", "Фильм 3", "Фильм 4", "Фильм 5"];
// movies.push("Интерстеллар");
// console.log(movies.includes("Интерстеллар"));
// console.log(movies.includes("Фильм 1"));

// for (let i = 0; i < movies.length; i++) {
//     console.log(movies[i]);
// }


// 5
// let movies = ["Фильм 1", "Фильм 2", "Фильм 3", "Фильм 4", "Фильм 5"];
// let moviesWithRating = movies.map(function(movie, index) {
//     return {
//         name: movie,
//         rating: index + 1
//     };
// });
// let goodMovies = moviesWithRating.filter(function(movie) {
//     return movie.rating > 3;
// });

// console.log(goodMovies);



// 6
// let person = {
//     name: "Али",
//     age: 25,
//     city: "Душанбе"
// }
// console.log(person.name);
// person.hobby = "программирование";
// console.log(person);
// person.age = 30;
// console.log(person);
// delete person.city;
// console.log(person);
